## Plan Result (sbox_shutter_webapp)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;plumclassic&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;plumclassic&#34;]
* Replace
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;plumclassic&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_cname_record.cname_record["plumclassic"] must be replaced
-/+ resource "azurerm_dns_cname_record" "cname_record" {
      ~ fqdn                = "hmcts-sbox.azurefd.net-shutter.frontdoor.sandbox.platform.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/frontdoor.sandbox.platform.hmcts.net/CNAME/hmcts-sbox.azurefd.net-shutter" -> (known after apply)
      ~ name                = "hmcts-sbox.azurefd.net-shutter" -> "plumclassic-shutter" # forces replacement
      - tags                = {} -> null
        # (4 unchanged attributes hidden)
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["plumclassic"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "frontdoor.sandbox.platform.hmcts.net"

      + record {
          + value = (known after apply)
        }
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["plumclassic"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "frontdoor.sandbox.platform.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-shutter-webapp-sbox-rg/providers/Microsoft.Web/staticSites/plumclassic"
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

Plan: 3 to add, 0 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1774,"Program":"tfcmt","SHA1":"","Target":"sbox_shutter_webapp","Vars":{}} -->